{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_13122","layers":[{"class_name":"Dense","config":{"units":18,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26243","trainable":true,"batch_input_shape":[null,24],"dtype":"float32"}},{"class_name":"Dense","config":{"units":4,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26244","trainable":true}}]},"keras_version":"tfjs-layers 1.5.1","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.1","convertedBy":null,"weightsManifest":[{"paths":["./best_snake.weights.bin"],"weights":[{"name":"dense_Dense26243/kernel","shape":[24,18],"dtype":"float32"},{"name":"dense_Dense26243/bias","shape":[18],"dtype":"float32"},{"name":"dense_Dense26244/kernel","shape":[18,4],"dtype":"float32"},{"name":"dense_Dense26244/bias","shape":[4],"dtype":"float32"}]}]}